### Imports the libraries

In [130]:
# وارد کردن کتابخونه به برنامه
import pandas as pd
import numpy as np
# فهمیدن ورژن پانداس
print(pd.__version__)

2.3.1

### Trick 01 - نحوه بررسی مصرف حافظه (Memory Usage) در Pandas

In [131]:
dft01 = pd.read_csv("../../00 DATA/Churn_Modelling.csv")
dft01.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.0000000000,1,1,1,101348.8800000000,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.8600000000,1,0,1,112542.5800000000,0
2,3,15619304,Onio,502,France,Female,42,8,159660.8000000000,3,1,0,113931.5700000000,1
3,4,15701354,Boni,699,France,Female,39,1,0.0000000000,2,0,0,93826.6300000000,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.8200000000,1,1,1,79084.1000000000,0

In [132]:
dft01.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [133]:
dft01.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 2.4 MB

In [134]:
# فهمیدن اینکه هر کدوم از ستون ها چقدر از حافظه را مصرف میکنه

dft01.memory_usage(deep=True)

Index                 132
RowNumber           80000
CustomerId          80000
Surname            554349
CreditScore         80000
Geography          550032
Gender             539086
Age                 80000
Tenure              80000
Balance             80000
NumOfProducts       80000
HasCrCard           80000
IsActiveMember      80000
EstimatedSalary     80000
Exited              80000
dtype: int64

### Trick 02 - نحوه تبدیل داده های گسسته (Convert) در Pandas

In [135]:
dft02 = pd.read_csv("../../00 DATA/titanic.csv")
dft02.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [136]:
dft02.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000000000,0,0,24160,211.3375000000,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9200000000,1,2,113781,151.5500000000,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000000000,1,2,113781,151.5500000000,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000000000,1,2,113781,151.5500000000,C22 C26,S,NaN,135.0000000000,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000000000,1,2,113781,151.5500000000,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [137]:
dft02.sex.info()

<class 'pandas.core.series.Series'>
RangeIndex: 1309 entries, 0 to 1308
Series name: sex
Non-Null Count  Dtype
--------------  -----
1309 non-null   object
dtypes: object(1)
memory usage: 10.4+ KB

#### a) کانورت دستی

In [138]:
# میخایم نوع دیتا تایپ رو به عدد تغیر بدیم چون اینجا اپجکت هست
dft02['sex num'] = dft02.sex.map({'male':0, 'female':1})
dft02.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,sex num
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000000000,0,0,24160,211.3375000000,B5,S,2,NaN,"St Louis, MO",1
1,1,1,"Allison, Master. Hudson Trevor",male,0.9200000000,1,2,113781,151.5500000000,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",0
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000000000,1,2,113781,151.5500000000,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000000000,1,2,113781,151.5500000000,C22 C26,S,NaN,135.0000000000,"Montreal, PQ / Chesterville, ON",0
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000000000,1,2,113781,151.5500000000,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1

#### b)  کانورت خودکار

In [139]:
dft02.embarked.info(), dft02.embarked.head()

<class 'pandas.core.series.Series'>
RangeIndex: 1309 entries, 0 to 1308
Series name: embarked
Non-Null Count  Dtype
--------------  -----
1307 non-null   object
dtypes: object(1)
memory usage: 10.4+ KB

(None,
 0    S
 1    S
 2    S
 3    S
 4    S
 Name: embarked, dtype: object)

In [140]:
# این دستور با استفاده از تابع فکتورایز به صورت خودکار مقدار دهی میکنه برای وقتی که بیش تر از دو پارامتر داریم خوبه
dft02['embarked num'] = dft02.embarked.factorize()[0]


dft02.embarked.head(20)

0     S
1     S
2     S
3     S
4     S
5     S
6     S
7     S
8     S
9     C
10    C
11    C
12    C
13    S
14    S
15    S
16    C
17    C
18    C
19    C
Name: embarked, dtype: object

In [141]:
dft02['embarked num'].head(20)

0     0
1     0
2     0
3     0
4     0
5     0
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    0
14    0
15    0
16    1
17    1
18    1
19    1
Name: embarked num, dtype: int64

In [142]:
# فهمیدن ترتیب دیتا
dft02.embarked.factorize()[1]

Index(['S', 'C', 'Q'], dtype='object')

#### c) روش سوم

In [143]:
# حالت باینری برای وقتاییی که میخایم صرفا یه جواب صفر یا یک داشته باشیم
# ستون sibsp یا ۰ هست یا ۱ یا ۲ ولی ما میخایم فقط ببینیم وجود داره یا نه (پس ۱ با ۲ بودن فرقی نداره)
dft02['sibsp'].head(40)

0     0
1     1
2     1
3     1
4     1
5     0
6     1
7     0
8     2
9     0
10    1
11    1
12    0
13    0
14    0
15    0
16    0
17    0
18    0
19    0
20    1
21    1
22    0
23    0
24    0
25    0
26    1
27    1
28    0
29    0
30    0
31    0
32    0
33    0
34    0
35    0
36    0
37    0
38    0
39    0
Name: sibsp, dtype: int64

In [144]:
dft02['sibsp_binary'] = (dft02['sibsp'] > 0).astype(int)
dft02['sibsp_binary'].head(20)

0     0
1     1
2     1
3     1
4     1
5     0
6     1
7     0
8     1
9     0
10    1
11    1
12    0
13    0
14    0
15    0
16    0
17    0
18    0
19    0
Name: sibsp_binary, dtype: int64

### Trick 03 - نحوه تبدیل داده های پیوسته (Convert) در Pandas

In [145]:
dft03 = pd.read_csv("../../00 DATA/titanic.csv")
dft03.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000000000,0,0,24160,211.3375000000,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9200000000,1,2,113781,151.5500000000,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000000000,1,2,113781,151.5500000000,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000000000,1,2,113781,151.5500000000,C22 C26,S,NaN,135.0000000000,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000000000,1,2,113781,151.5500000000,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

#### a)  روش دستی

In [146]:
# برای وقتی که درک از دیتا داریم
pd.cut(dft03.age , bins = [0,18,25,99], labels = ["child","young","old"]).head(20)

0       old
1     child
2     child
3       old
4     young
5       old
6       old
7       old
8       old
9       old
10      old
11    child
12    young
13      old
14      old
15      NaN
16    young
17      old
18      old
19      old
Name: age, dtype: category
Categories (3, object): ['child' < 'young' < 'old']

#### b) برای وقتی که درکی از دیتا نداریم

In [147]:
# p برای اینکه بگیم به چند بخش تقسیم کن
# تابع value_counts() این مقدار رو بهم ما نشون میده
pd.qcut(dft03['age'], q = 3).value_counts()
dft03.head(20)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000000000,0,0,24160,211.3375000000,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9200000000,1,2,113781,151.5500000000,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000000000,1,2,113781,151.5500000000,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000000000,1,2,113781,151.5500000000,C22 C26,S,NaN,135.0000000000,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000000000,1,2,113781,151.5500000000,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000000000,0,0,19952,26.5500000000,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000000000,1,0,13502,77.9583000000,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000000000,0,0,112050,0.0000000000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000000000,2,0,11769,51.4792000000,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000000000,0,0,PC 17609,49.5042000000,NaN,C,NaN,22.0000000000,"Montevideo, Uruguay"
10,1,0,"Astor, Col. John Jacob",male,47.0000000000,1,0,PC 17757,227.5250000000,C62 C64,C,NaN,124.0000000000,"New York, NY"
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0000000000,1,0,PC 17757,227.5250000000,C62 C64,C,4,NaN,"New York, NY"
12,1,1,"Aubart, Mme. Leontine Pauline",female,24.0000000000,0,0,PC 17477,69.3000000000,B35,C,9,NaN,"Paris, France"
13,1,1,"Barber, Miss. Ellen ""Nellie""",female,26.0000000000,0,0,19877,78.8500000000,NaN,S,6,NaN,NaN
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0000000000,0,0,27042,30.0000000000,A23,S,B,NaN,"Hessle, Yorks"
15,1,0,"Baumann, Mr. John D",male,NaN,0,0,PC 17318,25.9250000000,NaN,S,NaN,NaN,"New York, NY"
16,1,0,"Baxter, Mr. Quigg Edmond",male,24.0000000000,0,1,PC 17558,247.5208000000,B58 B60,C,NaN,NaN,"Montreal, PQ"
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0000000000,0,1,PC 17558,247.5208000000,B58 B60,C,6,NaN,"Montreal, PQ"
18,1,1,"Bazzani, Miss. Albina",female,32.0000000000,0,0,11813,76.2917000000,D15,C,8,NaN,NaN
19,1,0,"Beattie, Mr. Thomson",male,36.0000000000,0,0,13050,75.2417000000,C6,C,A,NaN,"Winnipeg, MN"

### Trick 04 - نحوه تغییر نمایش (Display Option) در Pandas

In [148]:
dft04 = pd.read_csv("../../00 DATA/titanic.csv")
dft04.fare

0      211.3375000000
1      151.5500000000
2      151.5500000000
3      151.5500000000
4      151.5500000000
            ...
1304    14.4542000000
1305    14.4542000000
1306     7.2250000000
1307     7.2250000000
1308     7.8750000000
Name: fare, Length: 1309, dtype: float64

#### a) تنظیم رقم اعشار

In [149]:
pd.set_option('display.float_format', lambda x: '%.10f' % x)

In [151]:
pd.set_option('display.float_format', lambda x: '%.1f' % x)
dft04.fare
# دقت کنید این کار روی کل پانداس اعمال میشه نه دیتا فریم

0      211.3
1      151.6
2      151.6
3      151.6
4      151.6
        ...
1304    14.5
1305    14.5
1306     7.2
1307     7.2
1308     7.9
Name: fare, Length: 1309, dtype: float64

#### b) برای ریست کردن

In [152]:
pd.reset_option('display.float_format')
dft04.fare

0       211.3375
1       151.5500
2       151.5500
3       151.5500
4       151.5500
          ...
1304     14.4542
1305     14.4542
1306      7.2250
1307      7.2250
1308      7.8750
Name: fare, Length: 1309, dtype: float64

In [154]:
pd.set_option('display.float_format', lambda x: '%.1f' % x)
print(dft04.fare)
pd.reset_option('display.float_format')
print(dft04.fare)

0      211.3
1      151.6
2      151.6
3      151.6
4      151.6
        ...
1304    14.5
1305    14.5
1306     7.2
1307     7.2
1308     7.9
Name: fare, Length: 1309, dtype: float64
0       211.3375
1       151.5500
2       151.5500
3       151.5500
4       151.5500
          ...
1304     14.4542
1305     14.4542
1306      7.2250
1307      7.2250
1308      7.8750
Name: fare, Length: 1309, dtype: float64

### Trick 05 - نحوه تغییر استایل (Styling) در Pandas

In [ ]:
import warnings
warnings.filterwarnings('ignore')
# این کار باعث میشه فایل نهایی شامل وارنینگ ها نباشه که از نظر بصری خروجی بهتری داشته باشیم

In [155]:
dft05 = pd.read_csv("../../00 DATA/stocks.csv")
dft05.head()

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT